 var lab1 = {
    name: "Перспективы развития цифровой экономики",
    name2: "",
    link: "",
    code: "",
     about: "<p>На цифровую экономику оказывают значительное влияние три закона: \r\n</p>" + 
"<p>1. Закон Меткалфа(полезность сети возрастает пропорционально квадрату сетевых узлов (количества пользователей)).Закон обусловливает высокие (в геометрической прогрессии) темпы роста цифровой экономики, ее ведущую роль в мировом экономическом развитии как в настоящем, так и в будущем;\r\n</p>" +
"<p>2. Закон Давидоу(продукты, первыми поступающие на рынок, способны получить долю в 50 %, другие продукты делят оставшуюся часть между собой).Закон обусловливает усиление конкуренции в цифровой экономике и превращение ее в конкуренцию между монопольными фирмами;\r\n</p>" +
"<p>3. Закон Мура(производительность процессоров удваивается, а цена снижается вдвое каждые 18 мес.).Закон обусловливает опережающую природу технологической конкуренции.\r\n</p>" +
"<p>При реализации оптимистичного сценария(достижение 4, 35 % роста ВВП в год) вклад цифровизации в темпы экономического роста будет еще выше – более 2 % ежегодно.Это связано с активизацией взаимодействия между традиционными отраслями и цифровой экономикой, более значительным увеличением инвестиционной активности.\r\n</p>" + 
"<p>Таким образом, вне зависимости от реализованного сценария развития российской экономики именно цифровизация станет ее важнейшей движущей силой.\r\n</p>" +  
"<p>В настоящее время цифровая экономика не только выделилась в отдельную сферу деятельности, но и проникла в традиционные отрасли, способствовала их трансформации, изменению методов ведения бизнеса.\r\n</p>" 
};

var lab2 = {
    name: "Индустрия 4.0",
    name2: "Перспективы развития Индустрии 4.0",
    link: "",
    code: "",
    about: "<p><b><mark>Индустрия 4.0</mark></b></p>" +
        "<p>Четвертая индустриальная революция (Индустрия 4.0) - переход на полностью автоматизированное цифровое производство, управляемое интеллектуальными системами в режиме реального времени в постоянном взаимодействии с внешней средой, выходящее за границы одного предприятия, с перспективой объединения в глобальную промышленную сеть Вещей и услуг. " +
        "В широком смысле, Индустрия 4.0 характеризует текущий тренд развития автоматизации и обмена данными, который включает в себя киберфизические системы, Интернет Вещей и облачные вычисления. Представляет собой новый уровень организации  производства и управления цепочкой создания стоимости на протяжении всего жизненного цикла выпускаемой продукции. " +
        "Несмотря на активное внедрение различных видов инфокоммуникационных технологий (ИКТ), электроники и промышленной робототехники в производственные процессы, автоматизация промышленности, начавшаяся в конце XX века, носила преимущественно локальный характер, когда каждое предприятие или подразделения внутри одного предприятия использовали собственную (проприетарную) систему управления (или их сочетание), которые были несовместимы с другими системами. " +
        "Развитие интернета, инфокоммуникационных технологий (ИКТ), устойчивых каналов связи, облачных технологий и цифровых платформ, а также информационный «взрыв» вырвавшихся из разных каналов данных, обеспечили появление открытых информационных систем и глобальных промышленных сетей, выходящих за границы отдельного предприятия и взаимодействующих между собой. Такие системы и сети оказывают преобразующее воздействие на все сектора современной экономики и бизнеса за пределами самого сектора ИКТ, и переводят промышленную автоматизацию на новую четвертую ступень индустриализации.</p>" +
        "<p><b><mark>Компоненты «Индустрии 4.0»</mark></b></p>" +
        "<p><i>1.Элементы Интернета вещей</i></p>" +
        "<p><i>2.Искусственный интеллект, машинное обучение и робототехника</i></p>" +
        "<p><i>3.Облачные вычисления</i></p>" +
        "<p><i>4.Big Data</i></p>" +
        "<p><i>5.Аддитивное производство</i></p>" +
        "<p><i>6.Кибербезопасность</i></p>" +
        "<p><i>7.Интеграционная система</i></p>" +
        "<p><i>8.Моделирование</i></p>" +
        "<p><i>9.Дополненная реальность</i></p>" +
        "<p>Многие из этих элементов уже давно и успешно применяются на практике, но именно объединение их в одну целостную систему позволит развить концепцию «Индустрии 4.0» и обеспечить новый уровень эффективности производства и дополнительный доход за счет использования цифровых технологий, формирования сетевого взаимодействия поставщиков и патнеров, а также реализации инновационных бизнес-моделей.</p>" +
        "<p><b><mark>Концепция Web 3.0</mark></b></p>" +
        "<p>Web 3.0 — это концепция следующего поколения интернета, которая стремится создать более интеллектуальное и семантически связанное взаимодействие между данными, приложениями и пользователями. В отличие от предыдущих версий интернета, Web 3.0 стремится к более глубокому пониманию смысла данных, обеспечивая более точные и релевантные результаты поиска, улучшенную автоматизацию и интеграцию различных технологий. " +
        "Эта концепция олицетворяет переход от пассивного потребления контента к более активному и контекстному взаимодействию между пользователями и интернет-ресурсами. Web 3.0 стремится сделать интернет более интуитивным, умным и полезным. В отличие от предыдущих версий, где пользователи часто действовали в качестве потребителей контента, в Web 3.0 они сами становятся активными участниками в создании данных и их обмене.</p>" +
        "<p><b><mark>Ключевые элементы работы Web 3.0</mark></b></p>" +
        "<p><i>Семантическая верстка</i></p>" +
        "<p>Web 3.0 стремится к более четкому пониманию смысла данных, благодаря использованию семантических технологий. Это означает, что компьютеры и программы способны анализировать контент, распознавать связи между ними и предоставлять более точные и релевантные результаты поиска.</p>" +
        "<p><i>Блокчейн и криптовалюты</i></p>" +
        "<p>Технология блокчейн играет важную роль в Web 3.0, обеспечивая децентрализованное и безопасное хранение данных. Смарт-контракты на блокчейне позволяют автоматизировать и обеспечивать доверенные сделки между участниками.</p>" +
        "<p><i>3D-визуализация и интерактивность</i></p>" +
        "<p>Web 3.0 уделяет большое внимание улучшенной визуализации и интерактивности. Это включает в себя создание трехмерных виртуальных миров, в которых пользователи могут взаимодействовать с данными и другими пользователями более естественным образом.</p>" +
        "<p><i>Искусственный интеллект</i></p>" +
        "<p>ИИ играет ключевую роль в Web 3.0, обеспечивая автоматическую аналитику, персонализированные рекомендации и даже автономные решения. Интеллектуальные алгоритмы помогают сортировать и обрабатывать огромные объемы данных для более точных результатов.</p>" +
        "<p><i>Ключевые особенности Web 3.0</i></p>" +
        "<p>Кроме выше упомянутых ключевых особенностей, Web 3.0 также характеризуется следующими аспектами:</p>" +
        "<p><i>Децентрализованные приложения (DApps). В Web 3.0 появляются децентрализованные приложения, которые работают на базе блокчейна. Эти приложения управляются смарт-контрактами и не требуют центральной инстанции для функционирования, что увеличивает безопасность и контроль данных у пользователей. Пример — кошелек Metamask.</i></p>" +
        "<p><i>Собственность над данными. Пользователи в Web 3.0 могут иметь больший контроль над своими данными. Децентрализованное хранение данных и смарт-контракты позволяют пользователям решать, кому и какие данные они хотят предоставлять.</i></p>" +
        "<p><i>Машинный обмен данных. В Web 3.0 машины и программы могут более эффективно обмениваться данными между собой, что способствует более слаженной работе систем и автоматизированным процессам.</i></p>" +
        "<p><i>Персонализация и адаптация. Благодаря интеллектуальным алгоритмам, Web 3.0 может предоставлять персонализированный контент и рекомендации в зависимости от предпочтений и поведения пользователя.</i></p>" +
        "<p><i>Безопасность и прозрачность. Использование блокчейна и криптографии делает Web 3.0 более безопасным и прозрачным. Записи в блокчейне нельзя легко подделать, что повышает доверие к данным и транзакциям.</i></p>" +
        "<p><i>Владение цифровыми активами. В Web 3.0 пользователи могут владеть цифровыми активами, такими как уникальные токены, допуская новые модели владения и экономические возможности.</i></p>" +
        "<p><i>Мультиплатформенность и совместимость. Web 3.0 стремится обеспечить совместимость между различными платформами и системами, позволяя более плавно и эффективно работать с данными и приложениями на разных устройствах.</i></p>"
};

var lab3 = {
    name: "Ключевые направления развития ИТ в концепции «Web 3.0»",
    name2: "Вездесущность и полная совместимость сетей связи",
    link: "",
    code: "",
    about: "<p><mark><b>Ключевые направления развития ИТ в концепции «Web 3.0»</b></mark></p>" +
        "<p><mark><b><i>Вездесущность и полная совместимость (Ubiquitous connectivity) сетей связи (подключение к IoT/IoE)</i></b></mark></p>" +

        "<p><b><i>Ubiquitous connectivity</i></b> - это идея о том, что все вокруг нас, а также мы сами, могут быть объединены в единую сеть. Эта идея стремительно развивается благодаря быстрому развитию новых технологий, таких как сетевые приложения, беспроводной доступ, 5G, человеко-машинное взаимодействие, автоматизация и отслеживаемость. Постоянное развитие беспроводных, 5G, широкополосных и других технологий подключения постоянно повышает планку вездесущего подключения и сетей.</p>" +
        "<p>Именно поэтому ubiquitous connectivity имеет решающее значение для будущего промышленности, поскольку мы вступаем в эпоху Индустрии 4.0.</p>" +
        "<p>Введение повсеместной связи - это путешествие в плане возможностей подключения, поскольку, глядя на развитие телекоммуникационных технологий, мы видим широкое внедрение таких вещей, как технология 5G.</p>" +
        "<p>Вездесущая связь - это не просто расширение больше возможностей для подключения. Речь идет о расширении возможностей подключения ко всему, о чем мы думаем, когда речь идет о промышленных приложениях, машинах и машинах, людях и машинах. Также ubiquitous connectivity подразумевает использование искусственного интеллекта и его распределение по всей сети.</p>" +
            "<p>Хотя на базовом уровне это означает, что однажды все будет подключено, основной фактор заключается в выполнении этой задачи интеллектуальным и эффективным способом для максимального использования ее потенциала, особенно когда речь идет об Индустрии 4.0.</p>" +
            "<p><b><i>Преимущества повсеместного подключения</i></b></p>" +
            "<p>Повсеместное сетевое взаимодействие может принести множество преимуществ самым разным приложениям, и одной из наиболее важных сфер является промышленный сектор. Повышение производительности, отслеживаемость, модернизация, использование и устойчивое развитие - вот причины роста повсеместного подключения.</p>" +
            "<p>“Привнесение интеллекта внутрь фабрики и интеллектуальное подключение - это важнейший способ реализации Индустрии 4.0 как в ближайшем, так и в отдаленном будущем. Слой интеллекта и обмена информацией может добавить дополнительный уровень производительности и использования к самой возможности подключения.</p>" +

            "<p>Такой тип связи позволяет создавать открытые среды и более динамичные промышленные экосистемы, что дает возможность частным или корпоративным сетям разработать более устойчивую финансовую модель. Помимо этого, повсеместная связь может значительно помочь в развертывании и обслуживании автоматизированных сетей в промышленных приложениях, а также позволит масштабировать промышленность на жизнеспособном уровне с точки зрения стоимости модернизации, устойчивости и производительности на внутреннем и международном уровне.</p>" +
                "<p>В целом, вездесущая связь - это ответ на многие вопросы, волнующие промышленный сектор сегодня и Индустрию 4.0 в будущем, такие как: “Как добиться максимального использования оборудования?Как увеличить пропускную способность? Как обеспечить высокую производительность на производственных линиях или в любой другой среде?”</p>" +
                "<p><b><i>Проблемы, с которыми сталкивается повсеместная связь</i></b></p>" +
                "<p>Однако не все, что окружает вездесущую связь, - это солнечный свет и радуга. Как и почти все грядущие технологии и достижения, она не лишена проблем, которые необходимо преодолеть, чтобы добиться успеха в будущем.</p>" +
                "<p>Прежде всего, существует серьезная проблема, связанная с устойчивостью сетей. Эта проблема затрагивает практически все сферы технологического прогресса - от автомобилей до центров обработки данных. По мере того как мир будет становиться все более и более экологичным, эта проблема будет решаться с помощью новых новаторских решений в области устойчивого развития.</p>" +
                "<p>Другая ключевая проблема, связанная с повсеместной связью, - это обеспечение масштабности. Как благословение и проклятие, природа повсеместной связи означает, что это, тема, которая теоретически может позволить подключить практически все и всех, однако основная проблема заключается в том, чтобы достичь этой точки эффективным, безопасным и устойчивым способом.</p>" +
                "<p><b><i>Основные области применения ИТ в концепции «Web 3.0»</i></b></p>" +
                "<p><b><i>Безопасность, приватность</i></b></p>" +
                "<p>Помимо улучшений Web 3.0, которые он может принести, возникает вопрос конфиденциальности и безопасности.</p>" +
                "<p>Web 3.0 основан на таких технологиях, как блокчейн, что позволит децентрализовать Интернет и даст пользователям большую власть. Таким образом, вместо того, чтобы доверять наши данные крупным компаниям и сильно зависеть от них, простой пользователь сможет создавать контент, инструменты и более децентрализованно использовать Интернет.</p>" +
                "<p><b><i>Описание Технологии Блокчейна</i></b></p>" +
                "<p><i>Определение: Блокчейн — это распределенный реестр, который децентрализованно хранит данные в цепочке блоков. Каждый блок содержит набор транзакций или информационных записей, которые защищены криптографически и связаны с предыдущим блоком в цепи.</i></p>" +
                "<p><i>Непрерывность и Неизменность: Одной из ключевых особенностей блокчейна является то, что однажды добавленная в блок информация не может быть изменена или удалена без изменения всех последующих блоков, что обеспечивает непрерывность и целостность данных.</i></p>" +
                "<p><i>Консенсус: В блокчейне принятие решений о добавлении новых блоков в цепочку осуществляется через процесс, известный как механизм консенсуса, который гарантирует, что все участники сети согласны с текущим состоянием реестра</i>.</p>" +
                "<p><b>Важность Блокчейна для Web 3.0</b></p>" +
                "<p><i>Децентрализация: Блокчейн позволяет создать децентрализованные приложения (DApps) для Web 3.0, устраняя необходимость в централизованных посредниках и позволяя пользователям напрямую взаимодействовать друг с другом.</i></p>" +
                "<p><i>Безопасность: Благодаря криптографическим алгоритмам и механизмам консенсуса, блокчейн обеспечивает высокий уровень безопасности данных и транзакций, что критически важно для веб-сервисов нового поколения.</i></p>" +
                "<p><i>Прозрачность и Неизменность: Регистрация транзакций в блокчейне обеспечивает прозрачность и возможность верификации, что придает доверие к цифровым операциям в сети Web 3.0.</i></p>" +
                "<p><i>Улучшенная Приватность: Блокчейн может предложить улучшенные решения для защиты личных данных, предоставляя пользователям контроль над их информацией и способами её использования.</i></p>" +
                "<p>Технология блокчейна играет ключевую роль в создании Web 3.0, предлагая решения для децентрализации, безопасности и прозрачности. Эта технология не только меняет способы хранения и обработки данных, но и открывает новые возможности для развития веб-сервисов, где пользователи имеют больший контроль и влияние.</p>" +
                "<p>Блокчейн и Web 3.0 стоят на пороге новой эры в развитии интернета, предлагая уникальные возможности для инноваций и преобразований. Хотя перед нами стоят серьезные технические, юридические и этические вызовы, перспективы и потенциал этих технологий делают их невероятно важными для будущего цифрового мира.</p>"
};
 

var Index = 1;
showSlides(Index);
function showSlides(n) {
    var i;
    var slides = document.getElementsByClassName("Slides");
    var buttons = document.getElementsByClassName("buttons");
    var person = document.getElementsByClassName("person");
    
    if (n > slides.length) {
        Index = 1
    }
    if (n < 1) {
        Index = slides.length
    }
    for (i = 0; i < slides.length; i++) {
        slides[i].style.display = "none";
    }
    for (i = 0; i < buttons.length; i++) {
        buttons[i].className = buttons[i].className.replace(" active", "");
    }
    slides[Index - 1].style.display = "block";
    buttons[Index - 1].className += " active";
    
    switch(Index){
        case 1:
            for(i = 0; i < person.length; i++){
                person[0].textContent = lab1.name;
                person[1].textContent = lab1.name2;
                person[2].innerHTML = lab1.about;
            }
            break;
        case 2:
            for(i = 0; i < person.length; i++){
                person[0].textContent = lab2.name;
                person[1].textContent = lab2.name2;
                person[2].innerHTML = lab2.about;
            }
            break;
        case 3:
            for(i = 0; i < person.length; i++){
                person[0].textContent = lab3.name;
                person[1].textContent = lab3.name2;
                person[2].innerHTML = lab3.about;
            }
            break;
    }
}

function go(n) {
    showSlides(Index += n);
}

function show(n) {
    showSlides(Index = n);
}
